WcfClient/XMLFile1.xml

<?xml version="1.0" encoding="utf-8" ?>
<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:a="http://www.w3.org/2005/08/addressing">
  <s:Header>
    <a:Action s:mustUnderstand="1">
      http://docs.oasis-open.org/ws-sx/ws-trust/200512/RST/Issue
    </a:Action>
    <a:MessageID>
      urn:uuid:3e6d674e-5639-4bda-8ea4-aa8eb94d26e6
    </a:MessageID>
    <a:ReplyTo>
      <a:Address>http://www.w3.org/2005/08/addressing/anonymous</a:Address>
    </a:ReplyTo>
    <a:To s:mustUnderstand="1">http://10.2.3.62:8077/SecurityTokenService</a:To>
  </s:Header>
  <s:Body>
    <trust:RequestSecurityToken Context="uuid-390cc40f-c458-4de2-8789-8a84b0dfdb74-3" xmlns:trust="http://docs.oasis-open.org/ws-sx/ws-trust/200512">
      <trust:TokenType>
        http://docs.oasis-open.org/ws-sx/ws-secureconversation/200512/sct
      </trust:TokenType>
      <trust:RequestType>http://docs.oasis-open.org/ws-sx/ws-trust/200512/Issue</trust:RequestType>
      <trust:KeySize>256</trust:KeySize>
      <trust:BinaryExchange ValueType="http://schemas.xmlsoap.org/ws/2005/02/trust/spnego" EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">TlRMTVNTUAABAAAAt7IY4gkACQAxAAAACQAJACgAAAAGA4AlAAAAD0lXUy1DSExJVVdPUktHUk9VUA==</trust:BinaryExchange>
    </trust:RequestSecurityToken>
  </s:Body>
</s:Envelope>